{
  "title": "Hành trình lựa chọn của bạn",
  "overview": "Bạn là một sinh viên năm nhất. Mỗi quyết định trong học tập, công việc và đóng góp xã hội sẽ tác động đến hướng đi tương lai.",
  "intro": {
    "title": "Tổng thể cốt truyện",
    "summary": [
      "Game gồm 4 phần theo 4 lĩnh vực: kinh tế, chính trị, tư tưởng - văn hóa, xã hội.",
      "Mỗi phần có 3 lựa chọn. Lựa chọn của bạn sẽ cộng hoặc trừ điểm nhiệt huyết và mở ra kết quả cuối cùng.",
      "Bạn có thể chơi lại để thử các chiến lược khác nhau."
    ],
    "next": "phan-1"
  },
  "steps": [
    {
      "id": "phan-1",
      "title": "Phần 1 - Kinh tế",
      "scenario": "Trong giờ học, lớp bạn đang thảo luận về nhiệm vụ xây dựng cơ sở vật chất - kỹ thuật.",
      "context": "Trong thời kỳ quá độ, nhiệm vụ quan trọng là xây dựng cơ sở vật chất - kỹ thuật. Sinh viên là lực lượng sản xuất mới.",
      "quote": "Tri thức trẻ phải tạo ra giá trị thật từ năng lực thật.",
      "choices": [
        {
          "id": "nghien-cuu-cong-nghe",
          "label": "Nghiên cứu công nghệ",
          "description": "Bạn tham gia nhóm phát triển ứng dụng nông nghiệp.\n\nKết quả:\n• Nông dân tăng năng suất\n• Bạn góp phần chuyển đổi số",
          "score": 2,
          "next": "phan-2"
        },
        {
          "id": "khoi-nghiep",
          "label": "Khởi nghiệp",
          "description": "Bạn quyết định thành lập một startup nhỏ cùng bạn bè, phát triển sản phẩm phục vụ cộng đồng.\n\nKết quả:\n• Sản phẩm của bạn được đưa vào sử dụng thực tế\n• Góp phần thúc đẩy đổi mới sáng tạo và phát triển kinh tế số\n• Bạn tích lũy kinh nghiệm và trưởng thành hơn",
          "score": 1,
          "next": "phan-2"
        },
        {
          "id": "kiem-tien-nhanh",
          "label": "Làm thêm để kiếm tiền nhanh",
          "description": "Bạn nhận công việc không liên quan chuyên ngành để kiếm thu nhập trước mắt.\n\nKết quả trước mắt:\n• Bạn có tiền chi tiêu\n• Bạn ít tham gia học thuật\n\nHậu quả sau:\n• Bạn bỏ lỡ cơ hội phát triển chuyên môn",
          "score": -1,
          "next": "phan-2"
        }
      ]
    },
    {
      "id": "phan-2",
      "title": "Phần 2 - Chính trị",
      "scenario": "Bạn thấy nhiều thông tin trái chiều trên mạng và không khí lớp học bắt đầu tranh luận gay gắt.",
      "context": "Sinh viên cần có bản lĩnh chính trị và hiểu biết pháp luật.",
      "quote": "Bản lĩnh công dân được thể hiện qua cách tiếp cận sự thật.",
      "choices": [
        {
          "id": "chia-se-cam-tinh",
          "label": "Chia sẻ chưa kiểm chứng",
          "description": "Bạn chia sẻ một bài viết gây tranh luận mà chưa kiểm chứng.\n\nBan đầu:\n• Bài viết nhận nhiều lượt tương tác\n\nSau đó:\n• Bạn phát hiện đó là thông tin sai\n• Uy tín của bạn giảm",
          "score": -2,
          "next": "phan-3"
        },
        {
          "id": "tham-gia-doi-thoai",
          "label": "Tham gia Đoàn - Hội",
          "description": "Bạn đăng ký tham gia chiến dịch tình nguyện và sinh hoạt Đoàn - Hội.\n\nKết quả:\n• Bạn được học tập về trách nhiệm công dân và lý tưởng thanh niên\n• Bạn tham gia tuyên truyền pháp luật và hỗ trợ cộng đồng\n• Bạn hiểu rõ hơn vai trò của sinh viên trong xây dựng và bảo vệ đất nước",
          "score": 2,
          "next": "phan-3"
        },
        {
          "id": "kiem-chung-thong-tin",
          "label": "Học nền tảng lý luận",
          "description": "Bạn chủ động học chủ nghĩa Mác-Lênin và tư tưởng Hồ Chí Minh.\n\nKết quả:\n• Bạn hiểu rõ con đường xây dựng chủ nghĩa xã hội ở Việt Nam\n• Bạn có khả năng phân tích và nhận diện thông tin sai lệch\n• Bạn hình thành bản lĩnh chính trị và lập trường tư tưởng vững vàng",
          "score": 2,
          "next": "phan-3"
        }
      ]
    },
    {
      "id": "phan-3",
      "title": "Phần 3 - Tư tưởng văn hóa",
      "scenario": "Trong lớp học, giảng viên giao nhiệm vụ truyền thông để lan tỏa giá trị cho giới trẻ.",
      "context": "Các bạn hãy dùng công nghệ và sáng tạo để lan tỏa giá trị văn hóa dân tộc.",
      "quote": "Bản sắc văn hóa không đứng yên, nó cần được sáng tạo và lan tỏa.",
      "choices": [
        {
          "id": "du-an-noi-dung-lich-su",
          "label": "Làm game lịch sử",
          "description": "Bạn làm game về chiến thắng Điện Biên Phủ.\n\nKết quả:\n• Sinh viên và người chơi hiểu rõ hơn về lịch sử dân tộc\n• Sản phẩm của bạn được giới thiệu trong hoạt động học tập và truyền thông",
          "score": 2,
          "next": "phan-4"
        },
        {
          "id": "lam-noi-dung-giat-gon",
          "label": "Làm nội dung theo xu hướng",
          "description": "Bạn tạo nội dung giải trí để thu hút nhiều lượt xem.\n\nBan đầu:\n• Bạn nhanh chóng có nhiều người theo dõi\n\nSau đó:\n• Nội dung không mang giá trị lâu dài\n• Bạn không đóng góp cho văn hóa",
          "score": -1,
          "next": "phan-4"
        },
        {
          "id": "to-chuc-ngay-hoi",
          "label": "Thiết kế truyền thông văn hóa",
          "description": "Bạn làm poster, video lịch sử.\n\nKết quả:\n• Poster và video được sử dụng trong các chương trình tuyên truyền\n• Góp phần lan tỏa giá trị văn hóa và truyền thống dân tộc",
          "score": 1,
          "next": "phan-4"
        }
      ]
    },
    {
      "id": "phan-4",
      "title": "Phần 4 - Xã hội",
      "scenario": "Nhà trường phát động chiến dịch tình nguyện và các dự án phục vụ cộng đồng để giảm khoảng cách thành thị - nông thôn.",
      "context": "Sinh viên không chỉ học cho bản thân mà còn có trách nhiệm phục vụ xã hội và nhân dân.",
      "quote": "Cống hiến xã hội là nơi đạo đức và năng lực gặp nhau.",
      "choices": [
        {
          "id": "xay-du-an-dai-han",
          "label": "Xây dự án 6 tháng",
          "description": "Bạn lập kế hoạch dài hạn cho chương trình kỹ năng số ở địa phương.\n\nKết quả:\n• Dự án tạo tác động bền vững\n• Học sinh được hỗ trợ liên tục",
          "score": 2,
          "next": "ket-qua"
        },
        {
          "id": "ket-noi-nguon-luc",
          "label": "Kết nối trường và doanh nghiệp",
          "description": "Bạn kêu gọi học bổng và thiết bị học tập cho học sinh vùng khó.\n\nKết quả:\n• Nguồn lực được mở rộng\n• Chương trình có thêm cơ hội triển khai thực tế",
          "score": 1,
          "next": "ket-qua"
        },
        {
          "id": "tham-gia-ngan-han",
          "label": "Tham gia một ngày cho có",
          "description": "Bạn tham gia theo phong trào ngắn hạn rồi rút lui.\n\nHệ quả:\n• Đóng góp không liên tục\n• Tác động xã hội bị hạn chế",
          "score": -1,
          "next": "ket-qua"
        }
      ]
    }
  ],
  "resultBands": [
    {
      "min": 6,
      "max": 8,
      "title": "Nhà tiên phong tri thức",
      "text": "Bạn trở thành tri thức trẻ có tầm nhìn dài hạn và tạo được tác động xã hội rõ ràng."
    },
    {
      "min": 3,
      "max": 5,
      "title": "Người lao động có ích",
      "text": "Bạn có nền tảng tốt và đang trên đường trở thành nhân tố then chốt của tập thể."
    },
    {
      "min": 0,
      "max": 2,
      "title": "Cần bổ sung định hướng",
      "text": "Bạn đã có một số lựa chọn đúng, nhưng cần kiên trì hơn để tạo kết quả bền vững."
    },
    {
      "min": -5,
      "max": -1,
      "title": "Cần tái khởi động",
      "text": "Bạn đang để mất cơ hội phát triển. Hãy chơi lại và ưu tiên các lựa chọn có trách nhiệm hơn."
    }
  ]
}
